In [ ]:
# load pandas
import pandas as pd
import numpy as np

In [ ]:
url = 'https://github.com/mattharrison/datasets/raw/master/data/vehicles.csv.zip'
df = pd.read_csv(url)

# loading the columns of the dataset
city_mpg = df.city08
highway_mpg = df.highway08

C:\Users\sunse\AppData\Local\Temp\ipykernel_2276\3267294540.py:2: DtypeWarning: Columns (68,70,71,72,73,74,76,79) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv(url)

## 7. Indexing Operations

- both series and dataframes have indexes

In [ ]:
# we can pass dictionary to map index label of 1 df to another df

# use the rename function
city2 = city_mpg.rename(make)
city2

Alfa Romeo    19
Ferrari        9
Dodge         23
Dodge         10
Subaru        17
              ..
Subaru        19
Subaru        20
Subaru        18
Subaru        18
Subaru        16
Name: city08, Length: 41144, dtype: int64

In [ ]:
# reset the index + rename
city2.rename_axis('make').reset_index()

             make  city08
0      Alfa Romeo      19
1         Ferrari       9
2           Dodge      23
3           Dodge      10
4          Subaru      17
...           ...     ...
41139      Subaru      19
41140      Subaru      20
41141      Subaru      18
41142      Subaru      18
41143      Subaru      16

[41144 rows x 2 columns]

In [ ]:
# reset index and drop current index
city2.reset_index(drop=True)

0        19
1         9
2        23
3        10
4        17
         ..
41139    19
41140    20
41141    18
41142    18
41143    16
Name: city08, Length: 41144, dtype: int64

In [ ]:
# locating by index value
city2.loc['Dodge']

Dodge    23
Dodge    10
Dodge    12
Dodge    11
Dodge    11
         ..
Dodge    18
Dodge    17
Dodge    14
Dodge    14
Dodge    11
Name: city08, Length: 2583, dtype: int64

In [ ]:
# using loc with mask
mask = city2 > 50
city2.loc[mask]

Nissan     81
Toyota     81
Toyota     81
Ford       74
Nissan     84
         ...
Tesla     140
Tesla     115
Tesla     104
Tesla      98
Toyota     55
Name: city08, Length: 236, dtype: int64

In [ ]:
# lambda function
def gt3(s):
    return s > True

gt3 = lambda s: s > 3 # one line of code

In [ ]:
# iloc = locating by index position
print(city2)

city2.iloc[1:5] # position 1 - 4

Alfa Romeo    19
Ferrari        9
Dodge         23
Dodge         10
Subaru        17
              ..
Subaru        19
Subaru        20
Subaru        18
Subaru        18
Subaru        16
Name: city08, Length: 41144, dtype: int64

Ferrari     9
Dodge      23
Dodge      10
Subaru     17
Name: city08, dtype: int64

In [ ]:
# heads and tails
print(city2.head())
print(city2.tail())

Alfa Romeo    19
Ferrari        9
Dodge         23
Dodge         10
Subaru        17
Name: city08, dtype: int64
Subaru    19
Subaru    20
Subaru    18
Subaru    18
Subaru    16
Name: city08, dtype: int64

In [ ]:
# data sampling
city2.sample(6, random_state=42)

Volvo         16
Mitsubishi    19
Buick         27
Jeep          15
Land Rover    13
Saab          17
Name: city08, dtype: int64

In [ ]:
# filtering with regex
city2.filter(regex='(Ford)|(Subaru)')

Subaru    17
Subaru    21
Subaru    22
Ford      18
Ford      16
          ..
Subaru    19
Subaru    20
Subaru    18
Subaru    18
Subaru    16
Name: city08, Length: 4256, dtype: int64

Exercise 10.10

In [ ]:
#q1, q2

print(city2.index)
print(city2.index.sort_values())

Index(['Alfa Romeo', 'Ferrari', 'Dodge', 'Dodge', 'Subaru', 'Subaru', 'Subaru',
       'Toyota', 'Toyota', 'Toyota',
       ...
       'Saab', 'Saturn', 'Saturn', 'Saturn', 'Saturn', 'Subaru', 'Subaru',
       'Subaru', 'Subaru', 'Subaru'],
      dtype='object', length=41144)
Index(['AM General', 'AM General', 'AM General', 'AM General', 'AM General',
       'AM General', 'ASC Incorporated', 'Acura', 'Acura', 'Acura',
       ...
       'smart', 'smart', 'smart', 'smart', 'smart', 'smart', 'smart', 'smart',
       'smart', 'smart'],
      dtype='object', length=41144)

In [ ]:
#q3
city2.reset_index()

            index  city08
0      Alfa Romeo      19
1         Ferrari       9
2           Dodge      23
3           Dodge      10
4          Subaru      17
...           ...     ...
41139      Subaru      19
41140      Subaru      20
41141      Subaru      18
41142      Subaru      18
41143      Subaru      16

[41144 rows x 2 columns]

In [ ]:
#q4
s2 = city2.reset_index().astype(str)
s2

            index city08
0      Alfa Romeo     19
1         Ferrari      9
2           Dodge     23
3           Dodge     10
4          Subaru     17
...           ...    ...
41139      Subaru     19
41140      Subaru     20
41141      Subaru     18
41142      Subaru     18
41143      Subaru     16

[41144 rows x 2 columns]

In [ ]:
#q5, q6
print(s2.head())
print(s2.tail())

        index city08
0  Alfa Romeo     19
1     Ferrari      9
2       Dodge     23
3       Dodge     10
4      Subaru     17
        index city08
41139  Subaru     19
41140  Subaru     20
41141  Subaru     18
41142  Subaru     18
41143  Subaru     16

In [ ]:
#q7
print(s2.iloc[10:110])

          index city08
10       Toyota     23
11   Volkswagen     18
12   Volkswagen     21
13   Volkswagen     18
14        Dodge     12
..          ...    ...
105      Toyota     16
106      Toyota     16
107  Volkswagen     18
108  Volkswagen     18
109  Volkswagen     15

[100 rows x 2 columns]

In [ ]:
#q8
city2.reset_index().reindex([20,10,2])

     index  city08
20     BMW      14
10  Toyota      23
2    Dodge      23